#+TITLE: Remove Stopwords
#+AUTHOR: Pei Hu

* The Script
The main function of this script is intended to remove stopwords from the tokenized sentences.
The input would be a list, which is in the format as following:
[('fileid::sentenceid1', ['word1', ..., 'wordn']), ..., ('fileid::sentenceidn', ['word1', ..., 'wordn'])].
The script would traverse into the dictionary, extract the word list for each sentence. Then the script would remove all the stopwords from that list.

The input file would be 'tokenized.p', and the output file would be 'stopwords_removed.p', where the pickle module is utilized to store and load the data.

#+BEGIN_SRC python
  import pickle
  from nltk.corpus import stopwords
  sentidx_words = pickle.load(open("tokenize.p", "rb"))
  for tup in sentidx_words:
          for idx, word in enumerate(tup[1]):
                  if word in stopwords.words('english'):
                          del tup[1][idx]
  pickle.dump(sentidx_words, open("stopwords_removed.p", "wb"))
#+END_SRC

These words are defined as stopwords in NLTK.
#+BEGIN_SRC python :results output
  from nltk.corpus iymport stopwords
  print(stopwords.words('english'))
#+END_SRC

#+RESULTS:
: ['i', 'me', 'my', 'myself', 'we', 'our', 'ours', 'ourselves', 'you', 'your', 'yours', 'yourself', 'yourselves', 'he', 'him', 'his', 'himself', 'she', 'her', 'hers', 'herself', 'it', 'its', 'itself', 'they', 'them', 'their', 'theirs', 'themselves', 'what', 'which', 'who', 'whom', 'this', 'that', 'these', 'those', 'am', 'is', 'are', 'was', 'were', 'be', 'been', 'being', 'have', 'has', 'had', 'having', 'do', 'does', 'did', 'doing', 'a', 'an', 'the', 'and', 'but', 'if', 'or', 'because', 'as', 'until', 'while', 'of', 'at', 'by', 'for', 'with', 'about', 'against', 'between', 'into', 'through', 'during', 'before', 'after', 'above', 'below', 'to', 'from', 'up', 'down', 'in', 'out', 'on', 'off', 'over', 'under', 'again', 'further', 'then', 'once', 'here', 'there', 'when', 'where', 'why', 'how', 'all', 'any', 'both', 'each', 'few', 'more', 'most', 'other', 'some', 'such', 'no', 'nor', 'not', 'only', 'own', 'same', 'so', 'than', 'too', 'very', 's', 't', 'can', 'will', 'just', 'don', 'should', 'now', 'd', 'll', 'm', 'o', 're', 've', 'y', 'ain', 'aren', 'couldn', 'didn', 'doesn', 'hadn', 'hasn', 'haven', 'isn', 'ma', 'mightn', 'mustn', 'needn', 'shan', 'shouldn', 'wasn', 'weren', 'won', 'wouldn']

So, whenever the script encountered those words in the word list for each sentence, that word is removed from the list.
